In [1]:
#dependencies
import pandas as pd

In [2]:
#create file paths
raw_school_data = "Resources/schools_complete.csv"
raw_student_data = "Resources/students_complete.csv"

In [3]:
#put raw data in dataframe
school_df = pd.read_csv(raw_school_data)
student_df = pd.read_csv(raw_student_data)

In [25]:
#show school dataframe
school_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [7]:
#show student dataframe 
student_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [8]:
merge_school_student = pd.merge(school_df, student_df, on='school_name')
merge_school_student.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [10]:
#rename columns
renamed_columns = merge_school_student.rename(columns={'school_name': 'School Name', 'type': 'School Type',
                                                       'size': 'School Size', 'budget': 'School Budget',
                                                       'student_name': 'Student Name', 'gender': 'Gender',
                                                       'grade': 'Grade', 'reading_score': 'Reading Score', 
                                                       'math_score':'Math Score'})
renamed_columns.head()

,School ID,School Name,School Type,School Size,School Budget,Student ID,Student Name,Gender,Grade,Reading Score,Math Score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [138]:
#count schools
unique_schools = renamed_columns['School Name'].nunique()
unique_schools

15

In [139]:
#calculate students in district
district_student = school_df['size'].sum()
district_student

39170

In [140]:
#calculate district budget
district_budget = school_df['budget'].sum()
district_budget

24649428

In [141]:
#calculate district avg math score
dist_avg_math = renamed_columns['Math Score'].mean()
dist_avg_math

78.98537145774827

In [142]:
#calculate district avg reading score
dist_avg_reading = renamed_columns['Reading Score'].mean()
dist_avg_reading

81.87784018381414

In [143]:
#calculate district percentage passing math
dist_pass_math = (renamed_columns[renamed_columns['Math Score'] >= 70].count()['Student Name'] * 100) / district_student
dist_pass_math

74.9808526933878

In [144]:
#calculate district percentage passing reading
dist_pass_reading = (renamed_columns[renamed_columns['Reading Score'] >= 70].count()['Student Name'] * 100) / district_student
dist_pass_reading

85.80546336482001

In [145]:
#calculate district overall passing
dist_pass_overall = (dist_pass_math + dist_pass_reading) / 2
dist_pass_overall

80.39315802910392

In [146]:
#district summary dataframe
district_data = [{'Total Schools': unique_schools, 'Total Students': district_student, 'Total Budget': district_budget, 
                     'Average Math Score': dist_avg_math, 'Average Reading Score': dist_avg_reading, 
                     '% Passing Math': dist_pass_math, '% Passing Reading': dist_pass_reading, 
                     '% Overall Passing': dist_pass_overall}]

district_summary = pd.DataFrame(district_data)
district_summary

,% Overall Passing,% Passing Math,% Passing Reading,Average Math Score,Average Reading Score,Total Budget,Total Schools,Total Students
0,80.393158,74.980853,85.805463,78.985371,81.87784,24649428,15,39170

In [147]:
#reorganize summary to make sense
reorganized_district_summary = district_summary[['Total Schools', 'Total Students', 'Total Budget', 
                                                 'Average Math Score', 'Average Reading Score', 
                                                 '% Passing Math', '% Passing Reading', '% Overall Passing']]

reorganized_district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,80.393158

In [148]:
#format district summary table
reorganized_district_summary['Total Students'] = reorganized_district_summary['Total Students'].map('{:,}'.format)
reorganized_district_summary['Total Budget'] = reorganized_district_summary['Total Budget'].map('${:,}'.format)
reorganized_district_summary['Average Math Score'] = reorganized_district_summary['Average Math Score'].map('{:.2f}'.format)
reorganized_district_summary['Average Reading Score'] = reorganized_district_summary['Average Reading Score'].map('{:.2f}'.format)
reorganized_district_summary['% Passing Math'] = reorganized_district_summary['% Passing Math'].map('{:.2f}%'.format)
reorganized_district_summary['% Passing Reading'] = reorganized_district_summary['% Passing Reading'].map('{:.2f}%'.format)
reorganized_district_summary['% Overall Passing'] = reorganized_district_summary['% Overall Passing'].map('{:.2f}%'.format)

reorganized_district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428",78.99,81.88,74.98%,85.81%,80.39%

In [181]:
#group by school name
grouped_school = renamed_columns.groupby(['School Name'])

avg_scores = grouped_school.mean()

avg_scores.head()

,School ID,School Size,School Budget,Student ID,Reading Score,Math Score
School Name,,,,,,
Bailey High School,7.0,4976.0,3124928.0,20358.5,81.033963,77.048432
Cabrera High School,6.0,1858.0,1081356.0,16941.5,83.975780,83.061895
Figueroa High School,1.0,2949.0,1884411.0,4391.0,81.158020,76.711767
Ford High School,13.0,2739.0,1763916.0,36165.0,80.746258,77.102592
Griffin High School,4.0,1468.0,917500.0,12995.5,83.816757,83.351499

In [182]:
#count students per school
sch_students = renamed_columns['School Name'].value_counts()

sch_students

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: School Name, dtype: int64

In [183]:
#each school budget
sch_budget = grouped_school['School Budget'].sum() / sch_students

sch_budget

Bailey High School       3124928.0
Cabrera High School      1081356.0
Figueroa High School     1884411.0
Ford High School         1763916.0
Griffin High School       917500.0
Hernandez High School    3022020.0
Holden High School        248087.0
Huang High School        1910635.0
Johnson High School      3094650.0
Pena High School          585858.0
Rodriguez High School    2547363.0
Shelton High School      1056600.0
Thomas High School       1043130.0
Wilson High School       1319574.0
Wright High School       1049400.0
dtype: float64

In [184]:
#calculate per student budget per school
sch_student_budget = sch_budget / sch_students

sch_student_budget

Bailey High School       628.0
Cabrera High School      582.0
Figueroa High School     639.0
Ford High School         644.0
Griffin High School      625.0
Hernandez High School    652.0
Holden High School       581.0
Huang High School        655.0
Johnson High School      650.0
Pena High School         609.0
Rodriguez High School    637.0
Shelton High School      600.0
Thomas High School       638.0
Wilson High School       578.0
Wright High School       583.0
dtype: float64

In [188]:
#calculate school % passing math
sch_pass_math = (renamed_columns[renamed_columns['Math Score'] >= 70].groupby('School Name')['Math Score'].count()) * 100 / sch_students
sch_pass_math

Bailey High School       66.680064
Cabrera High School      94.133477
Figueroa High School     65.988471
Ford High School         68.309602
Griffin High School      93.392371
Hernandez High School    66.752967
Holden High School       92.505855
Huang High School        65.683922
Johnson High School      66.057551
Pena High School         94.594595
Rodriguez High School    66.366592
Shelton High School      93.867121
Thomas High School       93.272171
Wilson High School       93.867718
Wright High School       93.333333
dtype: float64

In [189]:
#calculate school % passing reading
sch_pass_reading = (renamed_columns[renamed_columns['Reading Score'] >= 70].groupby('School Name')['Reading Score'].count()) * 100 / sch_students
sch_pass_reading

Bailey High School       81.933280
Cabrera High School      97.039828
Figueroa High School     80.739234
Ford High School         79.299014
Griffin High School      97.138965
Hernandez High School    80.862999
Holden High School       96.252927
Huang High School        81.316421
Johnson High School      81.222432
Pena High School         95.945946
Rodriguez High School    80.220055
Shelton High School      95.854628
Thomas High School       97.308869
Wilson High School       96.539641
Wright High School       96.611111
dtype: float64

In [ ]:
#calculate scho